backend/test/stress/scenarios/burst-traffic.yml
config:
  target: "http://localhost:3000"
  phases:
    - duration: 10
      arrivalRate: 50
      name: "Normal load"
    - duration: 5
      arrivalRate: 200
      name: "Burst spike"
    - duration: 10
      arrivalRate: 50
      name: "Post-burst cooldown"
  defaults:
    headers:
      Content-Type: "application/x-www-form-urlencoded"

scenarios:
  - name: "Burst traffic webhook"
    flow:
      - post:
          url: "/api/webhooks/twilio"
          body: "MessageSid=SM{{$randomString(32)}}&From=%2B15559{{$randomNumber(100000,999999)}}&To=%2B15550000000&Body=Burst+test& SmsStatus=received"
          expect:
            - statusCode: 200