backend/test/stress/scenarios/high-concurrency.yml
config:
  target: "http://localhost:3000"
  phases:
    - duration: 60
      arrivalRate: 100
      name: "High concurrency"
  defaults:
    headers:
      Content-Type: "application/x-www-form-urlencoded"

scenarios:
  - name: "High concurrency webhook"
    flow:
      - post:
          url: "/api/webhooks/twilio"
          body: "MessageSid=SM{{$randomString(32)}}&From=%2B15559{{$randomNumber(100000,999999)}}&To=%2B15550000000&Body=High+concurrency+test& SmsStatus=received"
          expect:
            - statusCode: 200